{"posts":[{"title":"My First Blog Post - Setting Up My Blog with Hexo and Icarus Theme","text":"Today marks the beginning of my journey into the world of blogging. I’m excited to share that I’ve successfully deployed my very own static blog on GitHub Pages using the powerful Hexo framework and the elegant Icarus theme. As a second-year graduate student pursuing a Master’s in Computer Science at Northeastern University, this blog serves as a platform for me to document my learning journey and share insights, thoughts, and ideas on various technical topics. Throughout my academic and professional endeavors, I’ve realized the importance of consolidating and articulating my understanding of complex concepts. This blog will be a space where I can organize my thoughts, delve into interesting topics, and contribute to the wider tech community. In the future, I look forward to refining and personalizing my blog. I aim to explore different customization options, experiment with various writing styles, and create a unique online presence that reflects both my personality and professional interests. I invite you to join me on this exciting venture as I navigate the world of technology, share my experiences, and engage in meaningful discussions. Stay tuned for more updates, insights, and reflections as I continue to evolve my blog and explore new horizons in the realm of Computer Science. Thank you for reading!","link":"/2024/04/29/my-first-blog/"},{"title":"I&#39;m coming back!","text":"Over the past month, I’ve been busy with moving. I started from Shanghai, where I completed my global coop, then to my hometown, and eventually back to Shanghai via Hong Kong before heading back to Boston. During this time, I also moved from my previous rental house to a new one. As a result, I haven’t updated this blog, which isn’t ideal. Developing a habit is challenging. Regularly writing blog posts, not just about technical topics, is something I truly want to cultivate. Moving forward, I realize that I must actively work on building this habit.","link":"/2024/06/03/blog/"}],"tags":[{"name":"“Reflections”","slug":"“Reflections”","link":"/tags/%E2%80%9CReflections%E2%80%9D/"},{"name":"“Reflections”, &quot;Daily Life&quot;","slug":"“Reflections”-Daily-Life","link":"/tags/%E2%80%9CReflections%E2%80%9D-Daily-Life/"}],"categories":[{"name":"Reflections","slug":"Reflections","link":"/categories/Reflections/"},{"name":"Hexo","slug":"Reflections/Hexo","link":"/categories/Reflections/Hexo/"},{"name":"DailyLife","slug":"Reflections/DailyLife","link":"/categories/Reflections/DailyLife/"}],"pages":[{"title":"About Me","text":"Me, Francex Xiang, also goes as Yanying Xiang. Currently a master student as Northeastern University.","link":"/about/index.html"}]}